neither-han/SS_ACDC_377D/SS_ACDC_3PH_1_377D/c2000.syscfg
epwm6.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm6.epwmDeadband_enableFED                                   = true;
epwm6.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.epwmDeadband_enableRED                                   = true;
epwm6.epwmDeadband_inputFED                                    = "EPWM_DB_INPUT_EPWMB";
epwm6.epwmDeadband_delayRED                                    = 10;
epwm6.epwmDeadband_delayFED                                    = 10;
epwm6.$name                                                    = "myEPWM6";
epwm6.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmCounterCompare_cmpA                                  = 250;
epwm6.epwmCounterCompare_cmpB                                  = 500;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmGlobalLoad_gld                                       = true;
epwm6.epwmGlobalLoad_gldPeriod                                 = "1";
epwm6.epwmGlobalLoad_enableOneShot                             = true;
epwm6.epwmGlobalLoad_oneShotMode                               = true;
epwm6.epwmCounterCompare_cmpAGld                               = true;
epwm6.epwmCounterCompare_cmpBGld                               = true;
epwm6.epwmActionQualifier_continousSwForceReloadModeGld        = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                 = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                 = true;
epwm6.epwmGlobalLoad_globalePWMLoadLink                        = "EPWM_LINK_WITH_EPWM_1";
epwm6.epwmTimebase_phaseEnable                                 = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmTimebase_period                                      = 2000;
epwm6.epwmTimebase_phaseShift                                  = 1333;
epwm6.epwmGlobalLoad_gldMode                                   = "EPWM_GL_LOAD_PULSE_CNTR_PERIOD";
epwm6.epwm.$assign                                             = "EPWM6";

epwm7.$name                                                    = "myEPWM7";
epwm7.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_periodLoadEvent                             = "EPWM_SHADOW_LOAD_MODE_COUNTER_SYNC";
epwm7.epwmTimebase_phaseEnable                                 = true;
epwm7.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm7.epwmDeadband_inputFED                                    = "EPWM_DB_INPUT_EPWMB";
epwm7.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.epwmDeadband_enableRED                                   = true;
epwm7.epwmDeadband_enableFED                                   = true;
epwm7.epwmDeadband_delayRED                                    = 10;
epwm7.epwmDeadband_delayFED                                    = 10;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmCounterCompare_cmpB                                  = 750;
epwm7.epwmCounterCompare_cmpA                                  = 500;
epwm7.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmGlobalLoad_gld                                       = true;
epwm7.epwmGlobalLoad_gldPeriod                                 = "1";
epwm7.epwmGlobalLoad_enableOneShot                             = true;
epwm7.epwmGlobalLoad_oneShotMode                               = true;
epwm7.epwmGlobalLoad_globalePWMLoadLink                        = "EPWM_LINK_WITH_EPWM_1";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                 = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                 = true;
epwm7.epwmActionQualifier_continousSwForceReloadModeGld        = true;
epwm7.epwmCounterCompare_cmpAGld                               = true;
epwm7.epwmCounterCompare_cmpBGld                               = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmTimebase_period                                      = 2000;
epwm7.epwmTimebase_phaseShift                                  = 1333;
epwm7.epwmGlobalLoad_gldMode                                   = "EPWM_GL_LOAD_PULSE_CNTR_PERIOD";
epwm7.epwm.$assign                                             = "EPWM7";

gpio1.$name           = "myGPIO0";
gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign = "GPIO36";

gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.$name           = "Epwm_EN_1";
gpio2.gpioPin.$assign = "GPIO23";

gpio3.$name           = "myGPIO2";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO24";

gpio4.$name           = "myGPIO3";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO25";

gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.$name           = "Epwm_EN_2";
gpio5.gpioPin.$assign = "GPIO89";

sysctl.splitCode = true;

FPUfastRTS1.$name = "myFFR0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
epwm2.epwm.epwm_aPin.$suggestSolution = "GPIO2";
epwm2.epwm.epwm_bPin.$suggestSolution = "GPIO3";
epwm3.epwm.epwm_aPin.$suggestSolution = "GPIO8";
epwm3.epwm.epwm_bPin.$suggestSolution = "GPIO9";
epwm4.epwm.$suggestSolution           = "EPWM3";
epwm5.epwm.epwm_aPin.$suggestSolution = "GPIO6";
epwm5.epwm.epwm_bPin.$suggestSolution = "GPIO7";
epwm6.epwm.epwm_aPin.$suggestSolution = "GPIO10";
epwm6.epwm.epwm_bPin.$suggestSolution = "GPIO11";
epwm7.epwm.epwm_aPin.$suggestSolution = "GPIO12";
epwm7.epwm.epwm_bPin.$suggestSolution = "GPIO13";
